[
    {
      "TranslatedRecipeName": "Masala Karela Recipe",
      "TranslatedIngredients": "1 tablespoon Red Chilli powder,3 tablespoon Gram flour (besan),2 teaspoons Cumin seeds (Jeera),1 tablespoon Coriander Powder (Dhania),2 teaspoons Turmeric powder (Haldi),Salt - to taste,1 tablespoon Amchur (Dry Mango Powder),6 Karela (Bitter Gourd/ Pavakkai) - deseeded,Sunflower Oil - as required,1 Onion - thinly sliced",
      "TotalTimeInMins": 45,
      "Cuisine": "Indian",
      "TranslatedInstructions": "To begin making the Masala Karela Recipe,de-seed the karela and slice.\nDo not remove the skin as the skin has all the nutrients.\nAdd the karela to the pressure cooker with 3 tablespoon of water, salt and turmeric powder and pressure cook for three whistles.\nRelease the pressure immediately and open the lids.\nKeep aside.Heat oil in a heavy bottomed pan or a kadhai.\nAdd cumin seeds and let it sizzle.Once the cumin seeds have sizzled, add onions and saute them till it turns golden brown in color.Add the karela, red chilli powder, amchur powder, coriander powder and besan.\nStir to combine the masalas into the karela.Drizzle a little extra oil on the top and mix again.\nCover the pan and simmer Masala Karela stirring occasionally until everything comes together well.\nTurn off the heat.Transfer Masala Karela into a serving bowl and serve.Serve Masala Karela along with Panchmel Dal and Phulka for a weekday meal with your family.\n",
      "URL": "https://www.archanaskitchen.com/masala-karela-recipe",
      "Cleaned-Ingredients": "salt,amchur (dry mango powder),karela (bitter gourd pavakkai),red chilli powder,gram flour (besan),onion,cumin seeds (jeera),coriander powder,turmeric powder,sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Pooja_Thakur/Karela_Masala_Recipe-4_1600.jpg",
      "Ingredient-count": 10
    },
    {
      "TranslatedRecipeName": "Spicy Tomato Rice (Recipe)",
      "TranslatedIngredients": " 2 teaspoon cashew - or peanuts, 1/2 Teaspoon mustard, 1 dry red chilli, 1 teaspoon white urad dal, 1 teaspoon chickpea lentils, salt - as per taste, 1 green chilli, 1-1 / 2 tablespoon oil - 1/2 teaspoon asafoetida, 1/2 teaspoon cumin seeds, 3 teaspoons BC Belle Bhat powder,2-1 / 2 cups rice - cooked, 3 tomatoes",
      "TotalTimeInMins": 15,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To make tomato puliogere, first cut the tomatoes.\nNow put in a mixer grinder and puree it.\nNow heat oil in a pan.\nAfter the oil is hot, add chana dal, urad dal, cashew and let it cook for 10 to 20 seconds.\nAfter 10 to 20 seconds, add cumin seeds, mustard seeds, green chillies, dry red chillies and curry leaves.\nAfter 30 seconds, add tomato puree to it and mix.\nAdd BC Belle Bhat powder, salt and mix it.\nAllow to cook for 7 to 8 minutes and then turn off the gas.\nTake it out in a bowl, add cooked rice and mix it.\nServe hot.\nServe tomato puliogre with tomato cucumber raita and papad for dinner.",
      "URL": "https://www.archanaskitchen.com/spicy-tomato-rice-recipe-in-hindi",
      "Cleaned-Ingredients": "tomato,salt,chickpea lentils,green chilli,rice,mustard,bc belle bhat powder,dry red chilli,cashew peanuts,oilasafoetida,cumin seeds,white urad dal",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/b.yojana-gmail.com/Spicy_Thakkali_Rice_Tomato_Pulihora-1_edited.jpg",
      "Ingredient-count": 12
    },
    {
      "TranslatedRecipeName": "Ragi Semiya Upma Recipe - Ragi Millet Vermicelli Breakfast",
      "TranslatedIngredients": "1 Onion - sliced,1 teaspoon White Urad Dal (Split),2 Green Chillies,Salt - to taste,1 teaspoon Lemon juice,1 teaspoon Ghee,1 teaspoon Mustard seeds,1/3 cup Green peas (Matar),1/4 teaspoon Asafoetida (hing),1/2 cup Carrots (Gajjar) - chopped,1 sprig Curry leaves,1-1/2 cups Rice Vermicelli Noodles (Thin)",
      "TotalTimeInMins": 50,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To begin making the Ragi Vermicelli Recipe, first steam the ragi vermicelli in a rice cooker or a steamer for about 5-6 minutes or till it is cooked but firm.Keep aside this aside till later use.\nYou can add a few drops of oil and mix it so that they don't stick to each other.Place a kadai on the heat, add the ghee or oil to it and when warm add hing and allow it to sizzle for 30 seconds.\nThen follow it up with mustard seeds, urad dal and curry leaves, and allow them to crackle.Saute for 1 minute or so till the urad dal is slightly browned.Then, add onions and fry till translucent and soft.Next, add the green chillies along with par boiled carrots and peas.\nSprinkle some salt and cook for 2-3 minutes or until the vegetables are semi cooked.Then, add the steamed ragi vermicelli toss it together so the vegetables are all well combined.Switch off the heat, take the vermicelli out into a serving dish and to with lemon juice.\nMix well and serve along with Coconut Chutney and a hot cup of coffee or tea for a wholesome breakfast.",
      "URL": "https://www.archanaskitchen.com/ragi-vermicelli-semiya-recipe-healthy-finger-millet-semiya-breakfast",
      "Cleaned-Ingredients": "salt,rice vermicelli noodles (thin),asafoetida (hing),mustard seeds,ghee,green peas (matar),carrot,curry leaves,white urad dal (split),onion,lemon,green chillies",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Monika_Manchanda/Ragi_vermicilli.jpg",
      "Ingredient-count": 12
    },
    {
      "TranslatedRecipeName": "Gongura Chicken Curry Recipe - Andhra Style Gongura Chicken",
      "TranslatedIngredients": "1/2 teaspoon Turmeric powder (Haldi),1 tablespoon Coriander (Dhania) Seeds,4 Dry Red Chillies,1 teaspoon Sesame (Gingelly) Oil,4 cloves Garlic,1 teaspoon Garam masala powder,Salt - to taste,2 tablespoon Sesame (Gingelly) Oil,4 Green Chillies - slit,500 grams Chicken,6 cloves Garlic - finely chopped,1 teaspoon Fennel seeds (Saunf),2 Onion - chopped,2 cups Sorrel Leaves (Gongura) - picked and chopped,1/4 teaspoon Methi Seeds (Fenugreek Seeds),1 inch Ginger - finely chopped,1 Tomato - chopped",
      "TotalTimeInMins": 45,
      "Cuisine": "Andhra",
      "TranslatedInstructions": "To begin making Gongura Chicken Curry Recipe first prep all the ingredients and keep them aside.In a small pan, dry roast the methi seeds, coriander seeds, fennel seeds and red chillies for about 3 to 4 minutes on medium heat, until you notice the seeds crackling.\nOnce done, turn off the heat and allow it to cool a bit and blend it into a smooth powder.Heat oil in a pressure cooker over medium heat; add the chopped onions, ginger, garlic and green chillies and saute until the onions are lightly browned and tender.Add the tomatoes, and saute until the tomatoes become soft and mushy.\nOnce done add the chicken, the garam masala and turmeric powder.\nAdd 1/4 cup of water and pressure cook the chicken for 3 to 4 whistles and turn off the heat.Once done, allow the pressure to release naturally.Make sure there are no stems when you pick the gongura leaves.\nWash and chop the gongura leaves and keep aside.In another pan,add some oil along garlic and saute the chopped gongura leaves along with a little salt and the ground masala.\nThe gongura leaves will wilt almost instantly.\nSaute the gongura in the masala for about 3 to 4 minutes until it becomes like a mushy paste.Once done, add the cooked chicken curry into the Gongura masala and saute on high heat for another 2 minutes and turn off the heat.Check the salt and spices and adjust according to taste.\nTransfer the Gongura Chicken Curry to a serving bowl and serve hot.Serve Gongura Chicken with Ghee Rice Recipe | Neychoru , Tomato Onion Cucumber Raita Recipe and a Semiya Payasam for a delicious weekend lunch.",
      "URL": "https://www.archanaskitchen.com/gongura-chicken-curry-recipe-andhra-style-gongura-chicken",
      "Cleaned-Ingredients": "tomato,salt,ginger,sorrel leaves (gongura),fennel seeds (saunf),sesame (gingelly) oil,cloves garlic,coriander (dhania) seeds,onion,chicken,methi seeds (fenugreek seeds),dry red chillies,turmeric powder,green chillies,garam masala powder",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/Ghongura_Chicken_Curry_Recipe-2_1600.jpg",
      "Ingredient-count": 15
    },
    {
      "TranslatedRecipeName": "Andhra Style Alam Pachadi Recipe - Adrak Chutney (Recipe)",
      "TranslatedIngredients": " oil - as per use, 1 tablespoon coriander seeds, 1 Teaspoon mustard, 3 inches ginger - chop, 1 tomato - chop, asafoetida - a pinch,1 tablespoon chana dal, 2 red chillies, salt - as per taste, 1 sprig curry, 1 tablespoon white urad dal, 1 onion - chop",
      "TotalTimeInMins": 30,
      "Cuisine": "Andhra",
      "TranslatedInstructions": "To make Andhra Style Alam Pachadi, first heat oil in a pan.\nAdd lentils and cook till it turns brown.\nNow add dry red chillies, coriander seeds, onion, ginger and cook till the onion becomes soft.\nAfter the onion is cooked, add tomatoes and cook till the tomatoes become soft.\nTurn off the gas and allow it to cool.\nAfter it cools down, put it in a mixer grinder and make a paste.\nFor tempering, heat the oil in a small pan.\nAdd mustard seeds and let it cook for 10 seconds.\nNow add curry leaves, asafoetida and let it cook for 10 seconds.\nAdd it to the chutney and mix.\nServe Andhra Style Alam Pachadi with Ghee Roast Dosa and Kirai Sambar for breakfast.",
      "URL": "https://www.archanaskitchen.com/andhra-style-allam-pachadi-ginger-chutney-recipe-in-hindi",
      "Cleaned-Ingredients": "tomato,salt,ginger,red chillies,curry,asafoetida,mustard,chana dal,onion,oil,coriander seeds,white urad dal",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/Andhra_Style_Allam_Pachadi_Ginger_Chutney_Recipe_.jpg",
      "Ingredient-count": 12
    },
    {
      "TranslatedRecipeName": "Pudina Khara Pongal Recipe (Rice and Lentils Cooked With Mint Leaves & Mild Spices)",
      "TranslatedIngredients": "1 cup Rice - soaked for 20 minutes,1 Green Chilli,Salt - to taste,1 teaspoon Cumin seeds (Jeera),1 cup Mint Leaves (Pudina) - tightly packed,5 cups Water,8 Cashew nuts - halved,1 inch Ginger,1/4 cup Coriander (Dhania) Leaves - tightly packed,1/2 cup Yellow Moong Dal (Split) - soaked for 20 minutes,2 tablespoons Ghee,1 teaspoon Sunflower Oil,1 sprig Curry leaves,1 pinch Asafoetida (hing),1 teaspoon Whole Black Peppercorns",
      "TotalTimeInMins": 30,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To begin making Pudina Khara Pongal Recipe, wash and soak the rice and dal for 20 minutes.Make a paste of mint/pudina, coriander, green chilli and ginger using a mixer grinder and keep aside.Now, heat oil in the pressure cooker, add the cumin seeds and let it crackle.Add the soaked rice and dal and fry for a few minutes.Add the mint coriander paste and saute for a minute.Add 5 cups of water, season with salt and pressure cook for 4 to 5 whistles and keep aside.In the mean prepare the tadka by heating ghee in a small tadka pan.Add in the cumin seeds, peppercorns and let it crackle.Add the cashew halves and fry till they turn golden.Add the curry leaves and asafoetida and turn off the flame.Once the pressure has been released, open the lid and mash the pongal mixture.Add in the tadka over it and Serve the Pudina Khara Pongal Recipe along with Kathirikai Gothsu Recipe (Spicy and Tangy Eggplant Curry)and South Indian Coconut Chutney for a relaxed weekend breakfast.",
      "URL": "https://www.archanaskitchen.com/pudina-khara-pongal-recipe-rice-and-lentils-cooked-with-mint-leaves-mild-spices",
      "Cleaned-Ingredients": "cashew nuts,salt,yellow moong dal (split),ginger,green chilli,rice,coriander (dhania) leaves,ghee,asafoetida (hing),water,black peppercorns,curry leaves,cumin seeds (jeera),mint leaves (pudina),sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/nithya.anantham/Mint_Khara_Pongal_Recipe.jpg",
      "Ingredient-count": 15
    },
    {
      "TranslatedRecipeName": "Udupi Style Ash Gourd Coconut Curry Recipe",
      "TranslatedIngredients": "4 Dry Red Chillies,1/2 teaspoon Turmeric powder (Haldi),1/2 teaspoon Mustard seeds,1 Dry Red Chillies,Sunflower Oil - for cooking,Salt - to taste,30 grams Tamarind Water,1 cup Tamarind Water,1/2 cup Fresh coconut - grated,2 sprig Curry leaves - roughly torn,500 grams Vellai Poosanikai (Ash gourd/White Pumpkin),1/2 teaspoon Methi Seeds (Fenugreek Seeds),2 teaspoons Sesame seeds (Til seeds),1 teaspoon Sunflower Oil,3 tablespoons Jaggery,2 teaspoons Coriander (Dhania) Seeds,1/2 teaspoon Cumin seeds (Jeera)",
      "TotalTimeInMins": 40,
      "Cuisine": "Udupi",
      "TranslatedInstructions": "To begin making the Udupi Style Ash Gourd Coconut Curry Recipe  cook the ash gourd in the pressure cooker with little water, turmeric powder and salt for just 1 whistle.\nRelease the pressure naturally.Soak the tamarind ball in hot water for about 15 minutes, and squeeze and keep the water.Then dry roast the spices and other ingredients for the ground paste in a pan except the coconut.\nThen grind it along with coconut to a smooth paste.In same pressure cooker which has the ash gourd add the paste and little water and give it stir.\nKeep the Udupi Ash Gourd Coconut Curry on the medium heat, Adjust the seasoning and texture if required.\nOnce done transfer it in a bowl.For the seasoning, heat oil in a small skillet and add mustard seeds and let it crackle.\nAfter the mustard seeds have crackled add the curry leaves and red chillies.\nTun off the heat after the red chillies have darkened and add it on top of the Udupi Style Ash Gourd Coconut Curry and serve.\nServe the Udupi Style Ash Gourd Coconut Curry Recipe along with steamed rice, Elai Vadam  and Pisarna Manga for lunch.",
      "URL": "https://www.archanaskitchen.com/udupi-style-ash-gourd-coconut-curry-recipe",
      "Cleaned-Ingredients": "salt,tamarind water,coconut,mustard seeds,jaggery,vellai poosanikai (ash gourdwhite pumpkin),curry leaves,dry red chillies,coriander (dhania) seeds,methi seeds (fenugreek seeds),cumin seeds (jeera),turmeric powder,sesame seeds (til seeds),sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/Udupi_Style_Ash_Gourd_Coconut_Curry_Recipe_.jpg",
      "Ingredient-count": 14
    },
    {
      "TranslatedRecipeName": "Mexican Style Black Bean Burrito Recipe",
      "TranslatedIngredients": "6 to 8 Spinach Leaves (Palak),1/4 cup Black beans - soaked overnight and  cooked,4 tablespoons Cheddar cheese,1 Onion - chopped,2 cloves Garlic - chopped,1 cup Rice - or brown rice,2 sprig Coriander (Dhania) Leaves,1 Lemon juice,4 tablespoon Hung Curd (Greek Yogurt),4 Spring Onion Greens - chopped,1 Tomato - chopped,4 Tortillas",
      "TotalTimeInMins": 40,
      "Cuisine": "Mexican",
      "TranslatedInstructions": "To begin making the Black Bean Burrito recipe, pick the coriander leaves and set aside, then finely slice the stalks.Keep it aside.Heat 1 tablespoon of oil in a heavy bottomed pan over a medium heat, add the chopped garlic and coriander stalks and fry till they become brown.Add the cooked beans, mix it well and cook for a minute.\nAdd the rice and cook for further 5 minutes.\nRemove from the heat and add coriander leaves that were kept aside.\nFor Salsa, toss together tomatoes, onions, spring onions, lime juice, coriander leaves, mix well using a fork and season to taste.Heat the tortillas on a griddle pan till it softens.\nLay it on a plate.Layer spinach leaves over the  tortilla.\nSpoon one-quarter of the fried rice and beans, top with a generous spoonful of salsa.Grate over some cheese and add a spoon of yoghurt.\nWrap up the burrito, then tuck it in.Repeat with the remaining ingredients to make the rest of the burritos.\nServe Black Bean Burrito with a side of chips and a healthy Green Apple, Radish & Pepper Salad  and a glass of Carrot Pineapple Orange Juice Recipe to make a delicious lunch or dinner.",
      "URL": "https://www.archanaskitchen.com/black-bean-burrito-recipe",
      "Cleaned-Ingredients": "tomato,spring onion greens,hung curd (greek yogurt),black beans,cloves garlic,rice brown rice,coriander (dhania) leaves,onion,lemon,cheddar cheese,spinach leaves (palak),tortillas",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Madhuri_Aggarwal/Black_Bean_Burrito.jpg",
      "Ingredient-count": 12
    },
    {
      "TranslatedRecipeName": "Spicy Crunchy Masala Idli Recipe",
      "TranslatedIngredients": "Mint Leaves (Pudina) - to taste,1/2 teaspoon Turmeric powder (Haldi),3 tablespoons Tomato Ketchup,2 teaspoons Sunflower Oil,1 cup Tomato - finely chopped,Coriander (Dhania) Leaves - to taste,Salt - to taste,2 Green Chillies - finely chopped,1 cup Green Bell Pepper (Capsicum) - thinly sliced,10 Idli - cut into strips,1/4 teaspoon Red Chilli powder,1 cup Onions - finely chopped",
      "TotalTimeInMins": 30,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To prepare Spicy Crunchy Masala Idli Recipe, Heat a tablespoon of oil in a heavy bottomed pan and stir fry them until they are lightly crisp.\nTransfer to a bowl and keep aside.In 2 teaspoons of oil the same pan; add in the onions, capsicum, green chillies and saute them on medium heat until tender.\nThis takes about 5 to 7 minutes.\n Add in the chopped tomatoes, salt, pepper, turmeric powder, chilli powder and stir well.\nSaute until the tomatoes turn soft.\nFinally stir in the tomato ketchup, the fried idli's the chopped coriander and mint leaves.\nStir fry on high heat until well combined just for about a minute.Turn off the heat and transfer the Spicy Crunchy Masala Idli Recipe to a serving bowl and serve hot topped with more date chutney or tomato ketchup.",
      "URL": "https://www.archanaskitchen.com/spicy-crunchy-masala-idli-recipe",
      "Cleaned-Ingredients": "tomato,salt,coriander (dhania) leaves,idli,red chilli powder,tomato ketchup,onion,green bell pepper (capsicum),mint leaves (pudina),turmeric powder,green chillies,sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/Guest_Writers/Jeny_John/Spicy_Crunchy_Masala_Idli_Recipe.jpg",
      "Ingredient-count": 12
    },
    {
      "TranslatedRecipeName": "Cauliflower Leaves Chutney (Recipe in Hindi)",
      "TranslatedIngredients": " 3 cloves garlic, 1 big Spoon oil, 2 tablespoons white urad dal, 1 teaspoon Rye,1 cup cabbage leaves, turmeric powder - a pinch, asafoetida - a pinch, 1/2 teaspoon Cumin seeds, 18 grams tamarind, salt - as per taste, 3/4 cup tomatoes, 1 sprig Curry leaves, 4 red chillies",
      "TotalTimeInMins": 25,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To make cauliflower leaf chutney, first of all take out the leaf inside the cabbage and wash it well.\nDry and cut it well.\nHeat the oil in a pan.\nAdd urad dal, dry red chilli and cook till the dal turns golden.\nKeep it aside.\nAdd some more oil to the same pan.\nAdd cabbage leaves, salt and cook till the leaves become soft.\nNow add tomatoes, garlic and mix well.\nCook until tomatoes are soft.\nAfter cooking, turn off the gas and allow this mixture to cool.\nPour it into a mixer grinder with the dal mixture and grind it.\nAdd some water and salt and grind it once more.\nFor tempering, add mustard seeds to a tempering pan.\nAfter 10 seconds, add cumin, asafoetida and curry leaves.\nAfter 15 seconds, add it to the chutney and mix.\nServe Cabbage Leaves Chutney with Vegetable Sambar and Rice for dinner.",
      "URL": "https://www.archanaskitchen.com/cauliflower-leaves-chutney-recipe-in-hindi",
      "Cleaned-Ingredients": "tomato,salt,turmeric powder,red chillies,spoon oil,rye,asafoetida,cloves garlic,curry leaves,cabbage leaves,tamarind,cumin seeds,white urad dal",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/anu.mallajosyula-gmail.com/Cauliflower_leaf_chutney_recipe_edited_1.jpg",
      "Ingredient-count": 13
    },
    {
      "TranslatedRecipeName": "Homemade Baked Beans Recipe (Wholesome & Healthy)",
      "TranslatedIngredients": "250 grams Dry beans - (such as cannellini or soya beans),1 teaspoon Cumin powder (Jeera),1/4 teaspoon Red Chilli powder - or cayenne pepper,1 Onion - finely chopped,1 clove Garlic - grated,1 teaspoon Extra Virgin Olive Oil,1 tablespoon Honey - or more to taste,500 grams Tomatoes - pureed,Salt and Pepper - (coarsely pounded pepper) to taste,1 teaspoon Dried oregano",
      "TotalTimeInMins": 120,
      "Cuisine": "Fusion",
      "TranslatedInstructions": "To begin making the homemade baked beans recipe, we first have to soak the beans overnight for about 8 hours in water.We also have to make the cooked tomato puree.\nClick here to see the recipe of how to make tomato puree at home.Once the beans are soaked well, our next step is to cook them.\nI like using the pressure cooker method to cook the beans.\nPlace the beans in the pressure, place the weight on, cover the pan and cook it along with 2-1/2 cups of water.\nAfter you heat 4 to 5 whistles, turn the heat to low and cook for another 15 minutes.Turn off the heat and allow the pressure cooker to release its pressure naturally.\nThis would take another 10 minutes.\nThe beans continue to cook under the pressure even when it is turned off.Once the pressure is released, open the cooker and drain out the excess liquids.\nYou store this liquid and use it in the vegetable stock or risotto.Once the beans are cooked, our next step is to spice it up to make the baked beans.Heat oil in a sauce pan on medium heat; add in the onions and garlic and give it a light sauté until the onions are tender.\nAdd the tomatoes, honey and the spices and give it a stir.Add in the cooked drained beans into the tomato gravy.\nStir fry the beans until the beans get well coated with the tomatoes.\nCover the pan, turn the heat to low and simmer the beans for about 30 minutes until you noticed the beans are well coated with the spices and tomatoes.\nCheck the salt and seasoning levels and adjust to suit your taste.You can optionally garnish the Homemade Baked Beans with coriander leaves and serve it along with toast, or Potato Cakes Recipe.",
      "URL": "https://www.archanaskitchen.com/homemade-baked-beans-recipe-wholesome-healthy",
      "Cleaned-Ingredients": "tomato,salt,cumin powder (jeera),pepper ( pepper),cloves garlic,virgin olive oil,onion,dry beans (such cannellini soya beans),red chilli powder cayenne pepper,dried oregano",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/World_Breakfast/Homemade_baked_beans_Recipe_healthy_breakfast_shutterstock_222439996.jpg",
      "Ingredient-count": 10
    },
    {
      "TranslatedRecipeName": "Veg Chili Cheese Burgers Recipe",
      "TranslatedIngredients": "1 tablespoon Tabasco Original - Hot Sauce,5 Pickled Jalapenos - sliced,1 Onion - chopped,1 Whole Egg,1 teaspoon Red Chilli flakes,1 tablespoon Red Chilli powder,1 Onions - chopped,Salt - to taste,2 Cheese Slices,2 Burger buns,2 Potatoes (Aloo) - pressure cooked,4 cloves Garlic - chopped,1 tablespoon Dried oregano,1 cup Homemade tomato puree,2 Tomatoes - chopped,1/2 cup Soy granules,1 Green Bell Pepper (Capsicum) - chopped,1/2 cup Whole Wheat Bread crumbs,1 teaspoon Honey,1 tablespoon Cumin powder (Jeera),Sunflower Oil",
      "TotalTimeInMins": 55,
      "Cuisine": "Continental",
      "TranslatedInstructions": "To begin making the Veg Chili Cheese Burgers Recipe, we will first pressure cook the potatoes and keep it ready.\nCook them for 5 whistles in a pressure cooker.\nOnce done allow the pressure to release naturally and peel off the skin.\nAdd them into a bowl and mash it using a potato masher.Add onions, salt and red chilli powder and bind it together.\nShape them into medium sized cutlets and leave it in the fridge to rest until you move on to make the sauce.To make the sauce, heat a flat skillet with oil on medium heat, add garlic and allow it soften for few seconds.Add chopped onions and saute until they turn golden brown.\nAdd chopped capsicum and saute for a few minutes.\nAdd in chopped tomatoes and sprinkle with a bit of salt and saute till they turn mushy.\nAlso add in the tomato puree and all the seasonings like, red chilli powder, cumin powder, red chilli flakes, dried oregano, tobacco sauce and honey.Keep sautéing until the tomatoes are cooked, you will notice the tomatoes will change color and the raw smell goes away.At the end add the soya granules and salt to taste.\nAdd about 1/4 cup of water and allow it to boil for 4-6 minutes minutes.\nLet the sauce be little gravish.Switch off the heat, heat a flat skillet for the patties to shallow fry them.\nTake the patties out of the fridge.\nBeat an egg into a bowl and also keep the bread crumbs ready over a plate.Carefully dip the patties into the egg and place them over the bread crumbs and coat them well on either side Dust off the excess bread crumbs.Place the crumb dipped patties on to the hot skillet and drizzle some oil on top.\nCook on either side for atleast 10 minutes.\nTill you can see brown color crispy layer on top.Do the same for the rest of the patties and set aside.Once done, add a tablespoon of butter on the same skillet and cut the burger bun in to half horizontally and toast them on the tawa.\nToast till the burger buns are golden brown and crisp.Take a cooked patty, spoon two tablespoon of the sauce on top, place a cheese slice over it and microwave the patty for just 10 seconds until you see the cheese melt.Take the patty out, spread some of the sauce on the base of the burger bun and place the patty with cheese on top and add few slices of jalapeno and close it with the burger top and serve.\nDo the same for the rest of the burger.Serve the Veg Chili Cheese Burgers Recipe along with baby potato stir fry and Mango Iced Tea Recipe to make it a complete meal.",
      "URL": "https://www.archanaskitchen.com/veg-chili-cheese-burgers-recipe",
      "Cleaned-Ingredients": "cheese,salt,burger buns,potato (aloo) pressure,tomato,soy granules,eggs,cumin powder (jeera),tabasco original sauce,sunflower oil,red chilli powder,cloves garlic,red chilli flakes,jalapenos,onion,green bell pepper (capsicum),wheat bread crumbs,dried oregano",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl-archanaskitchen.com/Veg_Chili_Cheese_Burgers_Recipe.jpg",
      "Ingredient-count": 18
    },
    {
      "TranslatedRecipeName": "Andhra Steel Ingavu Charu Recipe - Asfoitida Flavored Tamarand Rasam",
      "TranslatedIngredients": "1 teaspoon Asafoetida (hing),Sunflower Oil - for cooking,Salt - to taste,1 teaspoon Cumin seeds (Jeera),1 teaspoon Mustard seeds,1 teaspoon Methi Seeds (Fenugreek Seeds),2 cup Tamarind Water,1 sprig Curry leaves,1/2 cup Arhar dal (Split Toor Dal),1 pinch Asafoetida (hing)",
      "TotalTimeInMins": 30,
      "Cuisine": "Andhra",
      "TranslatedInstructions": "To begin making the Andhra Style Ingavu Chaaru Recipe pressure cook the tamarind water with toor dal, hing and salt for about 4 whistles.\nTurn off the flame and allow the pressure to release naturally.\nOpen the lif of the cooker and thoroughly mash the dal and bring the whole mixture together by mixing it well.\nTo temper, heat a kadai with oil, add mustard seeds, cumin seeds, fenugreek seeds and allow it to crackle.Add curry leaves, pinch of hing and leave it for 2 seconds and pour it over the rasam.\nServe the Andhra Style Ingavu Chaaru Recipe along with steamed rice and Gorikayi Palya Recipe  as a comforting meal during your week day.",
      "URL": "https://www.archanaskitchen.com/andhra-style-ingavu-chaaru-recipe-asafetida-flavored-tamarind-rasam",
      "Cleaned-Ingredients": "salt,arhar dal (split toor dal),tamarind water,mustard seeds,asafoetida (hing),curry leaves,cumin seeds (jeera),methi seeds (fenugreek seeds),sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/Andhra_Style_Ingavu_Chaaru_Recipe_Asafetida_flavored_Tamarind_Rasam.jpg",
      "Ingredient-count": 9
    },
    {
      "TranslatedRecipeName": "And fish soup recipe - Bengali style fish in tomato gravy",
      "TranslatedIngredients": "1-1/2 tablespoons Ginger - paste,1-1/4 cups Water - add 2 cups if you like a loose gravy,1/2 teaspoon Turmeric powder (Haldi),1 teaspoon Cumin powder (Jeera),Salt - to taste,4 Green Chillies - coarsely crushed,1 Tomato - finely chopped,Mustard oil - as required,1 teaspoon Coriander Powder (Dhania),1 tablespoon Coriander (Dhania) Leaves - optional,2 Bay leaves (tej patta),Sugar - a pinch (optional),600 grams Aar Maach (fish) - rohu/ katla fish (cut into thick steaks),1/2 teaspoon Cumin seeds (Jeera),2 Green Chillies - slit lengthwise",
      "TotalTimeInMins": 20,
      "Cuisine": "Bengali Recipes",
      "TranslatedInstructions": "To begin making the Aar Macher Jhol Recipe, firstly marinate the fish with salt and turmeric powder.Heat oil in a wok and shallow fry the fish on both sides till they turn crispy and golden.\nRemove and keep aside.Into the same wok, add bay leaves and cumin seeds.\nFry these for 1 minute and add the chopped tomatoes.Sauté well.\nInto this Bengali Style Fish Gravy, add turmeric powder, cumin powder, coriander powder and enough salt and sauté till tomatoes soften.\nAdd the ginger paste and coarsely crushed green chilies.\nSauté till raw smell goes away and oil floats.Now add the water and allow the Fish gravy to come to a boil.\nOnce the gravy starts boiling, add the fried fish and cook covered till fish has cooked through.\n[This should take about 6 to 8 minutes approximately]Once the fish has cooked through, add the slit green chilies, adjust salt if necessary and add sugar to taste.\nAllow it to cook for 5 minutes.Garnish this Bengali Fish Curry with coriander leaves and serve hot.\nServe piping hot Aar Macher Jhol – Fish In Spicy Tomato Gravy along with Steamed Rice and Begun Bhaja for a weekday lunch or dinner.\nEnjoy!",
      "URL": "https://www.archanaskitchen.com/aar-macher-jhol-recipe-bengali-style-fish-in-spicy-tomato-gravy",
      "Cleaned-Ingredients": "tomato,salt,cumin powder (jeera),coriander powder,bay leaves (tej patta),mustard oil,coriander (dhania) leaves,water,sugar,cumin seeds (jeera),ginger paste,turmeric powder,green chillies,aar maach (fish) rohu katla fish (cut steaks)",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/donna_george/Aar_Macher_Jhol__Bengali_Style_Fish_In_Spicy_Tomato_Gravy_1600.jpg",
      "Ingredient-count": 14
    },
    {
      "TranslatedRecipeName": "Saunf Aloo (Fennel Potato Curry) Recipe",
      "TranslatedIngredients": "1/4 cup Fresh cream - or 1/2 cup milk,5 Potatoes (Aloo) - halved with skin,2 teaspoon Fennel seeds (Saunf) - crushed,4 sprig Coriander (Dhania) Leaves - finely chopped,1 teaspoon Turmeric powder (Haldi),2 teaspoon Red Chilli powder",
      "TotalTimeInMins": 25,
      "Cuisine": "Punjabi",
      "TranslatedInstructions": "To begin with Saunf Aloo, heat oil in a pressure cooker.\nAdd turmeric powder, salt, red chilli powder and crushed fennel seeds till the fennel seeds turns golden in colour.Now add the potatoes and mix it properly with the masala.\nSauce it for 2-3 minutes and then add enough water to cover the potatoes in the cooker.Switch the heat after two whistles and once the pressure is released, open the lid of the pressure cooker.The next step is to add the cream or milk and mash a few potatoes to get a thicker consistency.\nLet it cook for 5 more minutes or until the cooker releases 2 more whistles.Garnish the Saunf Aloo with some roasted saunf and chopped coriander.\nServe Sauf Aloo along with Amritsari Dal and Whole Wheat lachha Paratha for a weekday meal.",
      "URL": "https://www.archanaskitchen.com/saunf-aloo-fennel-potato-curry-recipe",
      "Cleaned-Ingredients": "fennel seeds (saunf),potato (aloo) skin,milk,red chilli powder,coriander (dhania) leaves,turmeric powder",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Madhuri_Aggarwal/Saunf_Aloo__Fennel_Potato_Curry.jpg",
      "Ingredient-count": 6
    },
    {
      "TranslatedRecipeName": "South Indian Onion Chutney Recipe - South Indian Onion Chutney (Recipe)",
      "TranslatedIngredients": " 1 teaspoon cumin seeds, 2 teaspoons oil, 2 tablespoons black urad dal (split), salt - 1 teaspoon, 3 dry red chillies, 1/2 teaspoon oil, 1 tablespoon tamarind paste, as per taste Rye, 1 sprig curry leaves, 1/2 teaspoon jaggery,2 onions",
      "TotalTimeInMins": 40,
      "Cuisine": "South Indian Recipes",
      "TranslatedInstructions": "To make South Indian Onion Chutney, first of all chop the onion and keep it aside.\nNow heat 1 teaspoon of oil in the pan.\nAdd cumin seeds, dry red chillies and let it cook for 10 seconds.\nNow add urad dal in it and let it cook till it becomes golden.\nTurn off the gas and drain in a bowl.\nAdd another spoon of oil to the same pan.\nAdd onions and let it cook for 4 to 5 minutes.\nTurn off the gas and let it cool down.\nNow put urad dal, cumin and dry red chillies in the mixer grinder and grind them.\nAdd cooked onions, tamarind and jaggery.\nAdd some water and grind it.\nNow for the tempering, heat the oil in a small pan.\nAdd mustard seeds and curry leaves.\nAfter 10 seconds, add it to the chutney and mix.\nServe South Indian onion chutney with masala dosa or ghee dosa for a tsunag breakfast.",
      "URL": "https://www.archanaskitchen.com/south-indian-onion-chutney-recipe-in-hindi",
      "Cleaned-Ingredients": "salt,rye,jaggery,black urad dal (split),curry leaves,dry red chillies,onion,oil,tamarind paste,cumin seeds",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/Aparna/The_Healthy_South_Indian_Onion_Chutney_1600.jpg",
      "Ingredient-count": 10
    },
    {
      "TranslatedRecipeName": "Hariyali Egg Curry Recipe In Coriander and Mint Gravy",
      "TranslatedIngredients": "2 cups Coriander (Dhania) Leaves - tightly packed,4 cloves Garlic,1 inch Ginger - chopped,1 teaspoon Garam masala powder,1 Cinnamon Stick (Dalchini) - small,2 Green Chillies - chopped,1 Onion - roughly chopped,1 tablespoon Sunflower Oil,2 Cloves (Laung),1 Bay leaf (tej patta),4 Whole Eggs - boiled,2 tablespoons Fresh cream,1 cup Mint Leaves (Pudina) - chopped,2 teaspoons Coriander Powder (Dhania)",
      "TotalTimeInMins": 35,
      "Cuisine": "Indian",
      "TranslatedInstructions": "To begin making the Hariyali Egg Curry recipe, we will first make the Hariyali Masala.Into the Mixer Grinder (medium jar), add the Coriander leaves mint leaves, Green Chillies and 1/2 cup water.\nBlend all of them together to make a smooth paste and keep aside.Into the small jar of the mixer grinder, add the onions, ginger and garlic and grind to make a paste.\nHeat 1 tablespoon oil in a kadai over medium heat, add the Bay leaf (tej patta), Cloves, Cinnamon Stick and roast for a few seconds.\nAdd the Onion ginger garlic paste.Saute for 4 to 5 minutes until raw onion smell goes away.Once the onions are roasted, add garam masala powder, coriander powder and saute for a few seconds.Add the Hariyali Coriander Mint Mixture, the fresh cream and the 4 Boiled eggs.Add water if required to adjust the consistency of the Hariyali Egg Curry.\n Cover & simmer the Hariyali Egg Curry for 5 minutes.Check the salt and spices and adjust to according to your taste and transfer the Hariyali Egg Curry into a serving bowl.\nServe the Hariyali Egg Curry along with Malabar Parotta or  Whole Wheat Lachha Paratha and Burani Raita for a weeknight dinner.",
      "URL": "https://www.archanaskitchen.com/hariyali-egg-curry-recipe-in-coriander-and-mint-gravy",
      "Cleaned-Ingredients": "green chillies,ginger,bay leaf (tej patta),coriander (dhania) leaves,mint leaves (pudina),cloves garlic,cinnamon stick (dalchini),onion,coriander powder,eggs,cloves (laung),garam masala powder,sunflower oil",
      "image-url": "https://www.archanaskitchen.com/images/archanaskitchen/0-Archanas-Kitchen-Recipes/Hariyali_Egg_Curry_Recipe_Creamy_Coriander_and_Mint_Curry-5_1600.jpg",
      "Ingredient-count": 13
    }
   ]